// Title: Device Product Ingestion Latency Analysis
// Developed by: Junaid Mumtaz
// Version: v1.0
CommonSecurityLog
| where isnotempty(DeviceProduct)
| summarize
    ['average E2E IngestionLatency'] = round(avg(todouble(datetime_diff("minute", ingestion_time(), TimeGenerated))), 2)
    by DeviceProduct
| sort by ['average E2E IngestionLatency'] desc
| top 30 by ['average E2E IngestionLatency']
